requirements/wealth-level/outputs/jmeter/wealth-level-performance.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="财富等级接口性能测试">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="运行时变量">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="财富等级并发请求">
        <stringProp name="ThreadGroup.num_threads">${__P(threads,2)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,2)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器">
          <stringProp name="LoopController.loops">${__P(loops,5)}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET 财富等级">
          <stringProp name="HTTPSampler.domain">${__P(host,test2westarlive.gzxchate.com)}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/level/exeperience/v2/get</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">20000</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="请求参数">
            <collectionProp name="Arguments.arguments">
              <elementProp name="deviceType" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">deviceType</stringProp><stringProp name="Argument.value">0</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
              <elementProp name="systemLanguage" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">systemLanguage</stringProp><stringProp name="Argument.value">zh</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
              <elementProp name="appVersion" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">appVersion</stringProp><stringProp name="Argument.value">100.1.5.4</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
              <elementProp name="os" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">os</stringProp><stringProp name="Argument.value">android</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
              <elementProp name="ticket" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">ticket</stringProp><stringProp name="Argument.value">${__groovy(System.getenv('AUTOTEST_RUNTIME_TICKET'))}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
              <elementProp name="language" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">language</stringProp><stringProp name="Argument.value">en</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
              <elementProp name="appCode" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">appCode</stringProp><stringProp name="Argument.value">100154</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
              <elementProp name="uid" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">uid</stringProp><stringProp name="Argument.value">${__P(uid)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
              <elementProp name="appid" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">true</boolProp><stringProp name="Argument.name">appid</stringProp><stringProp name="Argument.value">soulfree</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="业务码必须为200">
            <collectionProp name="Asserion.test_strings"><stringProp name="code200">&quot;code&quot;:200</stringProp></collectionProp>
            <stringProp name="Assertion.custom_message">响应业务码不是200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>